app/controllers/sessions_controller.rb

  def new
    !cookies[:remember_user_SaaS].nil? ? @check = true : @check = false
    !cookies[:remember_user_SaaS].nil? ? @email ||= User.find_by(remember_token: User.digest(cookies[:remember_user_SaaS])).email : @email = "Correo Electronico"
---
SELECT  "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT 1  [["remember_token", "$2a$10$2lAl0uhcJ6p.oaZLducts.dOjvPneyjYPGU5zoLAmrKjiZKl881le"]]

  def create
    if !cookies[:remember_user_SaaS].nil?
      user = User.find_by(remember_token: User.digest(cookies[:remember_user_SaaS]))
      if !user.nil?
        sign_in user
        cookies.delete(:remember_user_SaaS)
        remmember_user
        redirect_back_or current_user
      end
    else
      user = User.find_by(email: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."remember_token" = ? LIMIT 1  [["remember_token", "6e0c9a909a40492abcb93c18aab4e258b032e5a9"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]